ECHO
Wizard command (Level 21+)

Usage: echo <message>

Sends a message to everyone in the current room except yourself. This is useful
for creating atmospheric messages or narrating events. Unlike the 'emote' 
command, the message appears without any indication of who sent it.

Example:
  > echo The ground trembles beneath your feet.
  (Everyone in the room sees: "The ground trembles beneath your feet.")

See also: EMOTE, WIZ
#
FORCE
Wizard command (Level 22+)

Usage: force <victim | all> <command>

Forces a character or all characters in the room to execute a command. This is
a powerful tool for controlling NPCs or helping/hindering players. Use with
caution as it can disrupt gameplay.

Examples:
  > force guard say I will protect this place!
  > force all smile
  > force thalon drop sword

Note: 'force all' will affect all non-wizard characters in the room.

See also: TRANS, SWITCH, WIZ
#
TRANS TRANSFER
Wizard command (Level 22+)

Usage: transfer <victim>
       transfer all

Transfers a character from their current location to your location. When used
with 'all', transfers all non-wizard players in the game to your location.
Very useful for gatherings, meetings, or rescuing stuck players.

Examples:
  > transfer redferne
  > transfer all

See also: GOTO, AT, WIZ
#
TRANSFER
See: TRANS
#
GOTO
Wizard command (Level 21+)

Usage: goto <location>

Instantly transports you to a specified location. The location can be a room
number or a character name. This is the primary navigation command for wizards.

Examples:
  > goto 3001
  > goto dragon
  > goto redferne

See also: TRANS, AT, WIZ
#
SHUTDOW
Wizard command (Level 24+)

This command exists only to prevent accidental shutdowns. It does nothing.
If you want to shutdown the game, use the 'shutdown' command instead.

See also: SHUTDOWN, QUI
#
SET
Wizard command (Level 23+)

Usage: set <name> skill '<skill>' <learned> <recognized>
       set <name> value <field> <value>

The set command allows you to modify a character's skills and attributes. 
This is a powerful command that should be used carefully as it can fundamentally
change a character's capabilities.

Skills that can be set include all spells and abilities like armor, teleport,
bless, blindness, burning hands, charm person, sneak, hide, steal, backstab,
kick, bash, rescue, etc.

Fields that can be set include: age, sex, class, level, height, weight, str,
stradd, int, wis, dex, con, gold, exp, flux, hit, move, sessions, alignment,
thirst, drunk, full.

Examples:
  > set redferne skill 'magic missile' 95 95
  > set bob value level 10
  > set alice value gold 5000
  > set thrak value str 18

Without arguments, shows all available skills and fields.

See also: ADVANCE, STAT, WIZ
#
SHUTDOWN
Wizard command (Level 24+)

Usage: shutdown
       shutdown reboot

Shuts down the game server. This is the most powerful command and should be
used with extreme caution. All players will be disconnected and the game will
stop running.

If used with 'reboot' argument, the server will attempt to restart automatically
after shutdown (if configured to do so).

Examples:
  > shutdown
  (Shuts down the server completely)
  > shutdown reboot
  (Shuts down and attempts to restart the server)

Note: Always warn players before shutting down to give them time to save and
reach a safe location.

See also: SHUTDOW, WIZLOCK, WIZ
#
AT
Wizard command (Level 21+)

Usage: at <location> <command>

Executes a command at a different location without moving there. The location
can be a room number or a character name. Very useful for checking or 
modifying things remotely.

Examples:
  > at 3001 look
  > at dragon stat dragon
  > at redferne tell redferne Hello from afar!

See also: GOTO, WIZ
#
SNOOP
Wizard command (Level 21+)

Usage: snoop <victim>
       snoop self

Allows you to see all input and output from another player's session. This is
useful for monitoring suspicious activity or helping confused players. To stop
snooping, use 'snoop self' or snoop another character.

Examples:
  > snoop redferne
  (You will now see everything redferne types and sees)
  > snoop self
  (Stops snooping)

Note: Use this command responsibly and respect player privacy.

See also: SWITCH, WIZ
#
SWITCH
Wizard command (Level 23+)

Usage: switch <character>

Allows you to take control of a mobile (NPC) or another character. Your 
original body will remain where you left it. Use 'return' to switch back to
your original character.

Example:
  > switch guard
  (You are now controlling the guard)
  > return
  (You return to your original character)

Warning: Be careful not to lose track of your original character!

See also: RETURN, SNOOP, WIZ
#
RETURN
Wizard command (Level 22+)

Usage: return

Returns you to your original character after using the 'switch' command. This
is essential after taking control of a mobile or another player.

Example:
  > switch dragon
  > return
  (You are back in your original body)

See also: SWITCH, WIZ
#
REROLL
Wizard command (Level 24+)

Usage: reroll <victim>

Rerolls a character's ability scores (strength, intelligence, wisdom, dexterity,
constitution). This gives the character a new random set of stats. Use with
caution as it permanently changes the character.

Example:
  > reroll redferne

See also: SET, ADVANCE, WIZ
#
WIZ WIZHELP
Wizard command (Level 21+)

Usage: wizhelp
       wizhelp <command>

Without arguments, lists all privileged commands available to you based on your
level. With a command name, displays detailed help for that specific wizard
command.

Examples:
  > wizhelp
  (Shows list of all available wizard commands)
  > wizhelp force
  (Shows help for the force command)

See also: HELP, COMMANDS
#
USERS
Wizard command (Level 21+)

Usage: users

Displays a list of all users currently connected to the game, including their
connection information (hostname/IP address). This is useful for identifying
players and detecting multiple connections from the same location.

Example:
  > users

See also: WHO, WIZ
#
WIZLOCK
Wizard command (Level 24+)

Usage: wizlock

Toggles the game lock, which prevents non-wizard players from connecting to
the game. This is useful during maintenance, testing, or dealing with serious
game issues. Only the highest level wizards can use this command.

Example:
  > wizlock
  (Game is now locked to mortal players)
  > wizlock
  (Game is now unlocked)

See also: SHUTDOWN, WIZ
#
NOTELL
Wizard command (Level 22+)

Usage: notell <victim>

Toggles whether a player can use the 'tell' command. This is useful for 
disciplining players who abuse the communication system. The player will not
be able to send or receive tells when this flag is active.

Example:
  > notell troublemaker
  (Player can no longer use tell)
  > notell troublemaker
  (Player can use tell again)

See also: NOSHOUT, NOEMOTE, FREEZE, WIZ
#
NOEMOTE
Wizard command (Level 22+)

Usage: noemote <victim>

Toggles whether a player can use emotes and social actions. This is useful for
disciplining players who abuse emotes. When active, the player cannot use
emote, social commands, or the emote shortcut (:).

Example:
  > noemote spammer
  (Player can no longer emote)
  > noemote spammer
  (Player can emote again)

See also: NOSHOUT, NOTELL, FREEZE, WIZ
#
FREEZE
Wizard command (Level 23+)

Usage: freeze <victim>

Freezes a player, preventing them from doing almost anything. This is a serious
disciplinary action, typically used for players who severely violate game rules
or for temporarily removing problem players from active gameplay.

Example:
  > freeze troublemaker
  (Player is now frozen)
  > freeze troublemaker
  (Player is unfrozen)

See also: NOTELL, NOEMOTE, NOSHOUT, WIZLOCK, WIZ
#
GOL
Wizard command (Level 24+)

Usage: gol <arguments>

This command is reserved for highest level administrators. Its exact function
is implementation-specific and not documented for security reasons.

See also: WIZ
#
SNOWBALL
Wizard command (Level 22+)

A playful social action available to wizards. Allows you to throw a snowball
at someone. While it's a wizard command due to its level requirement, it's
primarily for fun rather than administration.

Usage: snowball <victim>

Example:
  > snowball redferne

See also: SOCIAL ACTIONS, WIZ
STRING
For changing the text-strings associated with objects and characters. The
format is:

string <type> <name> <field> [<string> | <keyword>]

Type is either 'obj' or 'char'.
Field is one of the following(the names may be abbreviated):
Name                  (the call-name of an obj/char - kill giant)
Short                 (for inventory lists (obj's) and actions (char's))
Long                  (for when obj/character is seen in room)
Title                 (for players)
Description           (For look at. For obj's, must be followed by a keyword)
Delete-description    (only for obj's. Must be followed by keyword)

Where a string is expected as the last argument, a newline will make you enter
a string mode, and the game will prompt you for new lines to the string until
you exceed the maximum length for the string or you end a line with a '@'.
#
LOAD
For loading new objects or characters from the database. The format is:
load <type> <number>
Where <type> is either 'obj' or 'char', and number is the number of the object
or character you wish to create.
#
LOCATE
Wizard command (Level 22+)

Usage: locate char <vnum>
       locate obj <vnum>
       locate <keywords>

Finds all instances of mobs or objects in the game world. You can search by
virtual number (vnum) for exact matches, or by keywords to find all matching
entities.

When searching by vnum:
  - locate char <vnum>  : Finds all instances of a mob with that virtual number
  - locate obj <vnum>   : Finds all instances of an object with that vnum

When searching by keywords:
  - locate <keywords>   : Searches for both mobs and objects matching keywords

The output shows the location of each found entity:
  - Room number and name for items in rooms
  - Carrier name for items being carried by characters
  - Container name for items inside other objects

Examples:
  > locate char 3000
  (Shows all instances of mob vnum 3000 with their room locations)

  > locate obj 3099
  (Shows all instances of object vnum 3099 and where they are)

  > locate scientist
  (Searches for all mobs and objects with "scientist" in their keywords)

This is useful for:
  - Debugging zone resets and finding where specific entities load
  - Locating missing quest items or NPCs
  - Verifying that objects and mobs are loaded correctly
  - World building and testing

See also: LOAD, PURGE, STAT, GOTO
#
PURGE
A way to make the world a little cleaner.
Usage:
  purge                         To empty a room of monsters and objects.
  purge <character>             To remove a living thing. Kicks out a player.
  purge <object>                Figure this one out yourself.
#
STAT
If you're interested in a person and want to find out about his/her/its
skills, strength, flux, hitpoints etc.
   In addition, 'stat room' will give you useful information about the room
you're in.
#
WIZ
A listing of the commands for immortals (should be unavailable for mortals  :)
#
USERS
Tells you who's logged on to the game, and where they are playing from.
#
ADVANCE
To advance a player to a level higher than his present. Default is to advance
him one level. A level 0 player (Man/Woman) is always only advanced by one
level.
#
WIZHELP
List the privileged commands available to you. Can only be used by immortals.
#
NOSHOUT
Prevents you from (or allows you to) hearing shouts, if used with no arguments.
Can be used with the name of a player, to prevent him/her from hearing shouts,
as well as from shouting. Can only be used by certain more powerful beings.
#
RESTORE
If used on a mortal, this command will reset that players flux and hit points.
If used on an Immortal various values will be reset to their proper values.
#
#~
